dgarske/wolfssl-examples-stm32/STM32_Bare_Test/user_settings.h
/* user_settings.h
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * Multi-board wolfSSL config for STM32_Bare_Test.
 *
 * Board selected via -DSTM32_BOARD_<NAME> from the Makefile.
 * Build flavor selected via -DBUILD_BARE / -DBUILD_C from the Makefile.
 */

#ifndef WOLF_USER_SETTINGS_H
#define WOLF_USER_SETTINGS_H

#ifdef __cplusplus
extern "C" {
#endif

/* ---------------------------------------------------------------------- */
/* Board selection                                                        */
/* ---------------------------------------------------------------------- */
#if defined(STM32_BOARD_H573)
    #define WOLFSSL_STM32H5
    /* NUCLEO-H573ZI: Cortex-M33 with full crypto (TinyAES + HASH +
     * RNG + SAES + PKA V2 + DHUK). Distinct from H563 which only has
     * HASH + RNG + PKA. Same Nucleo-144 PCB as H563ZI (USART3
     * PD8/PD9 AF7 to ST-LINK VCP). TZEN should be 0 from factory
     * for this dev kit; if a future H573 ships TZEN=1 the option
     * byte needs to be flipped before running NS code. */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    #if defined(BUILD_BARE)
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_H5)
    #define WOLFSSL_STM32H5
    /* H563 has HASH + RNG + PKA only (no AES peripheral). H573 + H533 do
     * have AES; switching to one of those boards needs a different STM32
     * board flag. PKA is the V2 IP. */
    #define NO_STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    /* H563 has the reduced "light" PKA: ECDSA VERIFY runs in HW but the
     * silicon cannot SIGN (mode 0x24 aborts with OPERRF; confirmed on two
     * boards, bare + HAL, NS + TZEN=1 secure -- see /tmp ST report). ST
     * confirms this is by design: H563 is verify-only, H573 is full
     * sign+verify. Enabling WOLFSSL_STM32_PKA auto-selects
     * WC_STM32_PKA_VERIFY_ONLY for STM32H563xx (see port/st/stm32.h):
     * ECDSA verify -> HW PKA, ECDSA sign -> software. */
    #define WOLFSSL_STM32_PKA
#elif defined(STM32_BOARD_H7)
    #define WOLFSSL_STM32H7
    /* H753 has CRYP + HASH + RNG (CRYP IP, FIFO-based, like F4/F7) + SAES */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    /* CRYP IP supports 128/192/256-bit AES keys */
#elif defined(STM32_BOARD_U5)
    #define WOLFSSL_STM32U5
    /* U575 has HASH + RNG only -- NO AES, NO PKA. U585+ has AES + PKA;
     * switching to U585 needs the chip-specific board flag. */
    #define NO_STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
#elif defined(STM32_BOARD_U3)
    #define WOLFSSL_STM32U3
    /* U385 has AES + HASH + RNG + PKA (TinyAES IP) + SAES + DHUK.
     * DHUK Wrap is validated on this chip from NS state (KEYSEL=HW,
     * MODE=ENCRYPT path works; CCF asserts, deterministic chip-
     * bound output). DhukOp's MODE=DECRYPT wrapped-key unwrap path
     * does NOT complete from NS state on U3 -- SR.KEYVALID asserts
     * but CCF never fires. Likely requires secure-state context.
     * WOLFSSL_DHUK is therefore not enabled by default here; users
     * can build with -DWOLFSSL_DHUK to exercise Wrap and to debug
     * the unwrap path. */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    #if defined(BUILD_BARE)
        /* Both build paths: wolfssl's stm32.c now lists WOLFSSL_STM32U3 in
         * the PKA hal_pka.h include-chain, so the HAL build gets HW PKA too
         * (needed for DHUK seed-wrapped ECDSA sign under CUBEMX). The app
         * supplies the PKA handle -- see boards/u3/hw_init_cubemx.c. */
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_U585)
    #define WOLFSSL_STM32U5
    /* U585 has AES + HASH + RNG + SAES + PKA (V2 layout, TinyAES IP) */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    #if defined(BUILD_BARE)
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_U545)
    #define WOLFSSL_STM32U5
    /* U545 has AES + HASH + RNG + SAES + PKA (V2 layout, TinyAES IP) -
     * same crypto IP set as U585, lower-power sub-family. */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    #if defined(BUILD_BARE)
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_C5A3)
    #define WOLFSSL_STM32C5
    /* C5A3 has TinyAES + HASH + RNG + SAES + PKA (V2 layout, all on AHB2).
     * Same crypto IP set as U585/U545 (TinyAES) plus the new-gen HASH IP.
     * RNG: the earlier "CONDRST/SR.BUSY stuck" was NOT a silicon fault --
     * the RNG had no kernel clock. The C5 RNG runs off CK48
     * (RCC_CCIPR2.CK48SEL), whose reset default is NONE; nothing selected a
     * source, so conditioning stalled with no clock (CECS=0 because there are
     * no clock edges to flag). boards/c5a3/hw_init.c now sources CK48 from
     * HSIDIV3 (HSI/3 = 48 MHz, internal); with that the RNG conditions
     * immediately and returns entropy (validated on silicon). HW RNG enabled. */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define NO_STM32_HMAC  /* HW HASH state machine doesn't survive HKDF */
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    /* HW PKA: the C5 protected ECDSA SIGN now works in wolfSSL (mode 0x24 armed
     * before operands via wc_stm32_pka_arm_mode in stm32.c, SIGN path only;
     * validated R/S=OK vs ST's NIST P-256 CAVP vector, TARGET=c5sign). The plain
     * ECDSA VERIFY (0x26, confirmed a non-protected op == U5's verify) still
     * returns OUT_RESULT=0 in the wolfSSL context, on the standard path, even
     * though the bare probe verifies the identical operands OK -- an unresolved
     * context bug. Since verify is PUBLIC, HW PKA runs sign-only here: enabling
     * WOLFSSL_STM32_PKA on the C5 auto-selects WC_STM32_PKA_SIGN_ONLY (see
     * port/st/stm32.h), so HW signs and software verifies. */
    #if defined(BUILD_BARE)
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_V8)
    /* NUCLEO-V873XJ (STM32V873XJ): Cortex-M85, Armv8.1-M + Helium, 4 MB
     * flash, device ID 0x499 Rev B.
     *
     * Inventory read from STM32CubeProgrammer 2.22.0's SVD/STM32V873.svd:
     * CRYP (fat -- K0LR..K3RR, CSGCMCCM0..7R, GCM_CCMPH, 2-bit KEYSIZE, so
     * AES-192 IS supported), SAES (DHUK/BHK via CR.KEYSEL), HASH (new-gen,
     * CSR0..102 -> HASH_CR_SIZE 103, HR0..15 -> 64-byte digest), PKA (V2
     * with BOTH sign 0x24 and verify 0x26 -- not restricted like C5/H563),
     * RNG (CONDRST/NISTC/HTCR0..3) and CCB. All six clocks live on
     * RCC_AHB3ENR bits 0/1/2/3/8/15. That topology matches N6, so the
     * wolfSSL stm32.h arms should be cloned from N6, not from C5.
     *
     * HASH_CR.ALGO is 4 bits with 13 values. Seven -- 0x0/0x2/0x3/0xC/0xD/
     * 0xE/0xF -- match wolfSSL's existing new-gen SHA-1/2 mapping exactly.
     * The six extras (0x4-0x7, 0x8-0x9) are almost certainly SHA3-224/256/
     * 384/512 + SHAKE128/256, but the SVD enum names are placeholders so
     * that assignment is INFERRED, not documented -- confirm against the RM
     * or an on-silicon KAT before relying on it. Note there is no SHA3CFGR
     * register and the digest stops at 64 bytes, which strongly suggests a
     * fixed-length (non-resumable) XOF squeeze -- i.e. no ML-KEM/ML-DSA win.
     *
     * HW blocks are enabled one at a time as each is validated on this
     * silicon. */
    #define WOLFSSL_STM32V8
    /* Umbrella derives STM32_RNG/HASH/CRYPTO/HMAC; opt out of what is not
     * validated yet. RNG's MCG48 source is enabled in hw_init.c (V8 has no
     * CCIPR mux for it). */
    /* AES enabled 8/26, routed through the SAES instance like N6: the BARE
     * TinyAES driver shape matches SAES registers (IVR0..3, KEYR0..7); the
     * fat CRYP (IV0LR.., K0LR..) would need its own bare path wiring. Costs
     * AES-192 (settings.h gates NO_AES_192 on USE_SAES for V8, as for N6). */
    #define WOLFSSL_STM32_USE_SAES
    /* V2 PKA (sign AND verify, per PKA_CR.MODE enum). Operand RAM offsets
     * are IP constants emitted by svd2cmsis.py. BARE only, as on N657. */
    #if defined(BUILD_BARE)
        #define WOLFSSL_STM32_PKA
    #endif
    #define NO_STM32_HMAC  /* match C5A3/C562 until HKDF-over-HW is proven */
#elif defined(STM32_BOARD_C562)
    #define WOLFSSL_STM32C5
    /* NUCLEO-C562RE: same C5 family as C5A3. Same crypto IP set: AES
     * (CRYP-shape) + HASH + RNG on AHB2. The earlier "RNG CONDRST-stuck"
     * was not a silicon fault -- the RNG had no kernel clock (CK48 mux
     * defaulted to NONE). boards/c562/hw_init.c now sources CK48 from
     * HSIDIV3 (HSI/3 = 48 MHz), the same fix validated on the C5A3, so
     * HW RNG is enabled here too. NOT re-validated on hardware (no C562 on
     * the bench); flip back to NO_STM32_RNG if it regresses on silicon.
     * HW PKA stays off (the C5 protected-mode PKA<->RNG path is open work,
     * see the C5A3 arm). */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define NO_STM32_HMAC  /* HW HASH state machine doesn't survive HKDF */
    #define STM32_RNG
    #define NO_AES_192     /* TinyAES does not support 192-bit keys */
#elif defined(STM32_BOARD_F767)
    #define WOLFSSL_STM32F7
    /* STM32F767ZI silicon has RNG only -- NO CRYP, NO HASH peripheral.
     * Only F777xx and F779xx variants of the F7 line have HASH + CRYP.
     * BARE on F767 therefore only accelerates RNG; AES/SHA fall back
     * to software (or thumb2 ASM if CONFIG=asm). */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
#elif defined(STM32_BOARD_N657)
    #define WOLFSSL_STM32N6
    /* N657 silicon has CRYP + HASH + RNG + SAES + PKA, all on AHB3.
     *   HASH : new-gen IP (4-bit ALGO, same shape as H5/U3/C5). Enabled.
     *   RNG  : standard STM32 RNG. Enabled.
     *   AES  : routed through SAES via WOLFSSL_STM32_USE_SAES. SAES on
     *          N6 has the TinyAES-shape register layout (CR.EN bit 0,
     *          DATATYPE, MODE, CHMOD, KEYR0..7, IVR0..3, DINR, DOUTR,
     *          ISR/ICR) -- matches the BARE TinyAES driver in stm32.c.
     *          The older fat CRYP IP is not wired up (needs its own
     *          register-level driver; see RCC_AHB3ENR_CRYPEN arm).
     *   PKA  : V2 layout. Enabled and validated on silicon -- ECC_MUL
     *          (mode 0x20), ECDSA sign (0x24) and verify (0x26) all
     *          complete on HW (the earlier ECC_MUL-timeout note was
     *          stale; WC_STM32_PKA_DIAG confirms the op modes).
     * Runs the BARE app from AXISRAM2 (no internal flash) at 600 MHz
     * CPU. */
    /* AES routed to the SAES instance (same TinyAES-shape register path
     * validated on H7S3). The N6 "fat" CRYP is in the security domain and
     * times out from NS code, so SAES is the NS-accessible AES IP. */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define WOLFSSL_STM32_USE_SAES   /* route TinyAES driver to SAES */
    #define NO_AES_192               /* TinyAES does not support 192-bit */
    #if defined(BUILD_BARE)
        /* V2 PKA validated on N6 silicon: ECC_MUL (mode 0x20), ECDSA sign
         * (0x24) and verify (0x26) all complete on HW. The earlier
         * ECC_MUL-timeout note was stale. */
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_WB55)
    #define WOLFSSL_STM32WB
    /* WB55 has AES1 (TinyAES) + RNG + PKA, NO HASH peripheral. PKA on
     * WB55 is the V1 IP (single ECC scalar mul; no coefB/primeOrder). */
    #define STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    #if defined(BUILD_BARE) && !defined(STM32_BUILD_CUBEMX)
        /* wolfssl's stm32.c V1 PKA on WB hits the same RSign/SSign
         * field-name mismatch as WL55 under cubemx; ECC falls back
         * to SW for cubemx until the upstream port handles it. */
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_WL55)
    #define WOLFSSL_STM32WL
    /* WL55JC: dual-core M4 + M0+, sub-GHz radio. Crypto on the M4 side
     * is TinyAES + RNG + PKA (V1 layout, same as WB55), no HASH. WL has
     * tight 64K SRAM so we run minimal wolfcrypt -- bench only. RNG
     * kernel clock is routed to MSI 4 MHz in board hw_init (the default
     * RNGSEL = PLL Q has no clock); BARE wc_GenerateSeed handles
     * SECS/CECS recovery so the IP stays usable under sustained load. */
    #define STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    #if defined(BUILD_BARE) && !defined(STM32_BUILD_CUBEMX)
        /* wolfssl's stm32.c V1 PKA type definitions on WL (e.g.
         * PKA_ECDSASignOutTypeDef.RSign/SSign) differ from what the
         * shared port code expects; build hits ~5 type-mismatch
         * errors. Limit PKA to BARE for now -- cubemx falls back to
         * SW ECC. */
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_G491)
    #define WOLFSSL_STM32G4
    /* STM32G491RE has RNG + PKA but NO AES and NO HASH peripheral.
     * (The AES block is only on the G4A1xx variant in this G4 sub-family.)
     * BARE on G491 therefore only accelerates RNG (and PKA, when the
     * bare-metal PKA driver lands). AES/SHA fall back to software. */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
#elif defined(STM32_BOARD_G474)
    #define WOLFSSL_STM32G4
    /* STM32G474RE has RNG + PKA but NO AES and NO HASH peripheral.
     * G474 is a non-crypto G4 variant; the AES IP lives on the crypto-
     * enabled G4 variants only (G414 / G441 / G483 / G484 / G4A1). BARE
     * on G474 therefore accelerates RNG + ECC (via V1 PKA) only; AES/SHA
     * fall back to software. The wolfssl-side WOLFSSL_STM32G4 arm
     * already wires AES via RCC_AHB2ENR_AESEN -- a future G484 / G4A1
     * board would pick that up automatically. */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
#elif defined(STM32_BOARD_WBA52)
    #define WOLFSSL_STM32WBA
    /* WBA52 has TinyAES + HASH + RNG + PKA + SAES (V2 PKA layout). */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    #if defined(BUILD_BARE)
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_F207)
    #define WOLFSSL_STM32F2
    /* STM32F207ZG silicon has RNG only -- NO CRYP, NO HASH peripheral.
     * (CRYP+HASH are only on F215xx/F217xx in the F2 line.) BARE on
     * F207 therefore only accelerates RNG; AES/SHA fall back to
     * software (or thumb2 ASM if CONFIG=asm). */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
#elif defined(STM32_BOARD_F303)
    #define WOLFSSL_STM32F3
    /* STM32F303xE has NO HW crypto -- no CRYP, no HASH, no TRNG.
     * Pure software wolfCrypt; thumb2 inline-asm is available under
     * CONFIG=asm. */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define NO_STM32_RNG
#elif defined(STM32_BOARD_F437)
    #define WOLFSSL_STM32F4
    #define STM32_HASH
    #define STM32_CRYPTO
    #define STM32_RNG
    /* F4 CRYP peripheral does not support 192-bit keys */
    #define NO_AES_192
#elif defined(STM32_BOARD_F439)
    #define WOLFSSL_STM32F4
    #define STM32_HASH
    #define STM32_CRYPTO
    #define STM32_RNG
    /* F4 CRYP peripheral does not support 192-bit keys */
    #define NO_AES_192
#elif defined(STM32_BOARD_L4A6)
    #define WOLFSSL_STM32L4
    /* STM32L4A6ZG silicon has AES + HASH + RNG (TinyAES IP shape on
     * AHB2). No PKA, no SAES. First L4-family entry in the BARE matrix. */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
#elif defined(STM32_BOARD_H723)
    #define WOLFSSL_STM32H7
    /* STM32H723ZG silicon has RNG only -- the H72x sub-family does not
     * include CRYP/HASH (only H7A3/H7B3 do). BARE on H723 therefore
     * only accelerates RNG; AES/SHA fall back to software. */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
#elif defined(STM32_BOARD_H7A3)
    #define WOLFSSL_STM32H7
    /* STM32H7A3ZI-Q silicon has RNG only. The "value-line" H7A3/H7B3
     * sub-family swapped the classic H7's CRYP/HASH IPs for larger
     * flash/SRAM and DSI peripherals -- only RNG remains. Same surface
     * as the H723 arm; AES/SHA fall back to software. */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
#elif defined(STM32_BOARD_H7S3)
    /* NUCLEO-H7S3L8 (Cortex-M7, H7RS family). Silicon HW crypto:
     * "fat" CRYP (same shape as H753) + classic HASH (same shape as
     * H753) + RNG + SAES (TinyAES-shape) + V2 PKA. All on AHB3ENR (vs
     * classic H7 which has CRYP/HASH/RNG on AHB2). First H7-family port
     * with V2 PKA + SAES.
     *
     * AES routing: ST's H7S Cube examples drive AES exclusively via the
     * SAES instance -- the plain CRYP is in the security domain by
     * default and times out from non-secure code. We therefore route
     * the BARE TinyAES driver to SAES via WOLFSSL_STM32_USE_SAES.
     * SAES on H7S has the same register layout as on U5/H5/WBA/C5 so
     * the existing TinyAES code path is reused unmodified.
     */
    #define WOLFSSL_STM32H7S
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define WOLFSSL_STM32_USE_SAES   /* route TinyAES driver to SAES */
    #define NO_AES_192               /* TinyAES does not support 192-bit */
    #if defined(BUILD_BARE)
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_L552)
    #define WOLFSSL_STM32L5
    /* L552ZE has HASH + RNG only -- NO AES, NO PKA. L562 has the
     * full set (TinyAES + PKA + SAES); switching to L562 needs the
     * chip-specific board flag. TrustZone is disabled at option-byte
     * level for this BARE build (TZEN=0xC3). */
    #define NO_STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
#elif defined(STM32_BOARD_L562)
    #define WOLFSSL_STM32L5
    /* L562 has TinyAES + HASH + RNG + PKA (V1) + SAES + DHUK. The
     * L562E-DK on the bench ships with TZEN=0 so the BARE binary
     * runs from 0x08000000 in non-secure state directly. */
    #define STM32_CRYPTO
    #define STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    #if defined(BUILD_BARE)
        #define WOLFSSL_STM32_PKA
    #endif
#elif defined(STM32_BOARD_U083)
    #define WOLFSSL_STM32U0
    /* NUCLEO-U083RC: Cortex-M0+, 256 KB flash, 40 KB SRAM. TinyAES IP
     * + RNG only. No SAES, no HASH, no PKA, no CRYP. Lowest-end board
     * in the matrix -- AES is the only HW accelerator. */
    #define STM32_CRYPTO
    #define NO_STM32_HASH
    #define STM32_RNG
    #define NO_AES_192   /* TinyAES does not support 192-bit keys */
    /* U0 is 256 KB flash / 40 KB SRAM. Default user_settings (P-384,
     * P-521, Curve25519, Ed25519, SHA-384/512) overflows by ~28 KB,
     * so drop the heavy-tail algorithms and large math sizes. Keep
     * AES + SHA-256 + P-256 + ChaCha/Poly + HKDF as a minimal TLS-
     * facing surface. */
    #define STM32_U083_TRIM
    #define WOLFSSL_SMALL_STACK
#elif defined(STM32_BOARD_G071)
    #define WOLFSSL_STM32G0
    /* NUCLEO-G071RB: Cortex-M0+, 128 KB flash, 36 KB SRAM. NO HW
     * crypto IPs at all -- no AES, no HASH, no RNG, no PKA. Everything
     * runs in software. Smaller flash than U083 (128 KB vs 256 KB) so
     * the same trim set as U083 is applied. HASH_DRBG is seeded from
     * the BARE SysTick + boot-jitter entropy fallback (no HW RNG). */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define NO_STM32_RNG
    #define STM32_G071_TRIM
    #define WOLFSSL_SMALL_STACK
#elif defined(STM32_BOARD_C031)
    #define WOLFSSL_STM32C0
    /* NUCLEO-C031C6: Cortex-M0+, 32 KB flash, 12 KB SRAM. The smallest
     * MCU in the matrix. ZERO HW crypto. The wolfcrypt_test suite alone
     * is ~80 KB+ even when stripped to the bone -- it cannot fit. The
     * C031_TRIM disables RUN_WOLFCRYPT_TEST_SUITE and trims the SW path
     * to only the algorithms exercised by main_test.c's KAT block:
     * SHA-256, AES-CBC/ECB, ChaCha20-Poly1305. Even that is tight. */
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define NO_STM32_RNG
    #define STM32_C031_TRIM
    #define WOLFSSL_SMALL_STACK
#else
    #error "Define one of STM32_BOARD_C031 / STM32_BOARD_H5 / STM32_BOARD_H573 / STM32_BOARD_H7 / STM32_BOARD_H723 / STM32_BOARD_H7A3 / STM32_BOARD_H7S3 / STM32_BOARD_U5 / STM32_BOARD_U3 / STM32_BOARD_U585 / STM32_BOARD_U545 / STM32_BOARD_U083 / STM32_BOARD_C562 / STM32_BOARD_C5A3 / STM32_BOARD_WB55 / STM32_BOARD_WL55 / STM32_BOARD_G071 / STM32_BOARD_G474 / STM32_BOARD_G491 / STM32_BOARD_WBA52 / STM32_BOARD_F207 / STM32_BOARD_F303 / STM32_BOARD_F437 / STM32_BOARD_F439 / STM32_BOARD_F767 / STM32_BOARD_L4A6 / STM32_BOARD_L552 / STM32_BOARD_L562 / STM32_BOARD_V8"
#endif

