dgarske/wolfssl-examples-stm32/STM32_Bare_Test/user_settings.h
/* ---------------------------------------------------------------------- */
/* Build flavor                                                           */
/* ---------------------------------------------------------------------- */
#if defined(BUILD_BARE)
    /* CONFIG=bare drives wolfcrypt through the STM32 HW IP blocks. Two
     * BUILD axes select HOW: BUILD=bare uses the direct-register
     * WOLFSSL_STM32_BARE path; BUILD=cubemx uses ST's HAL drivers via
     * WOLFSSL_STM32_CUBEMX. The per-board family / STM32_RNG / STM32_HASH
     * etc. enables stay identical -- only the dispatch in
     * wolfcrypt/src/port/st/stm32.c differs. */
    #if defined(STM32_BUILD_CUBEMX) && !defined(STM32_HAL_NEWGEN)
        #define WOLFSSL_STM32_CUBEMX
        /* wolfssl's settings.h pulls the HAL umbrella header for each
         * family but is missing WOLFSSL_STM32U0 / WOLFSSL_STM32C0 /
         * WOLFSSL_STM32F3. Include the umbrella here so the
         * CRYP_HandleTypeDef prototype in wolfcrypt/port/st/stm32.h
         * resolves. */
        #if defined(STM32_BOARD_U083)
            #include "stm32u0xx_hal.h"
        #elif defined(STM32_BOARD_C031)
            #include "stm32c0xx_hal.h"
        #elif defined(STM32_BOARD_F303)
            #include "stm32f3xx_hal.h"
        #endif
        /* Tell wolfssl's stm32.c port to auto-enable CRYP / HASH / RNG /
         * PKA peripheral clocks from its wc_Stm32_*_Init() helpers via
         * __HAL_RCC_*_CLK_ENABLE(). Without this define the caller is
         * supposed to enable them in MX_*_Init MSPInit hooks, but the
         * STM32_Bare_Test hw_init_cubemx.c does not generate those --
         * it inits clock + UART directly, then lets wolfcrypt drive
         * everything else lazily. */
        #define STM32_HW_CLOCK_AUTO
        /* On U5 / U3 / L4 / L5 / G0 / G4 the AES IP is TinyAES, exposed
         * as the "AES" peripheral by the HAL (e.g. __HAL_RCC_AES_CLK_ENABLE).
         * wolfssl's stm32.h aliases the CRYP clock macros to AES only for
         * H5 / C5; the other TinyAES families need the same alias on the
         * application side when STM32_HW_CLOCK_AUTO is in effect. */
        #if defined(STM32_BOARD_U585) || defined(STM32_BOARD_U5) || \
            defined(STM32_BOARD_U545) || defined(STM32_BOARD_U3) || \
            defined(STM32_BOARD_L4A6) || defined(STM32_BOARD_L552) || \
            defined(STM32_BOARD_L562) || defined(STM32_BOARD_G071) || \
            defined(STM32_BOARD_G491) || defined(STM32_BOARD_G474) || \
            defined(STM32_BOARD_WBA52) || \
            defined(STM32_BOARD_WL55) || defined(STM32_BOARD_U083)
            #define __HAL_RCC_CRYP_CLK_ENABLE   __HAL_RCC_AES_CLK_ENABLE
            #define __HAL_RCC_CRYP_CLK_DISABLE  __HAL_RCC_AES_CLK_DISABLE
        #elif defined(STM32_BOARD_WB55)
            /* WB has TinyAES exposed as AES1 (not "AES"). */
            #define __HAL_RCC_CRYP_CLK_ENABLE   __HAL_RCC_AES1_CLK_ENABLE
            #define __HAL_RCC_CRYP_CLK_DISABLE  __HAL_RCC_AES1_CLK_DISABLE
        #endif
        /* On U0 / L4 / L5 / G0 / G4 etc. the TinyAES instance is
         * `AES` (not `CRYP`). wolfssl's stm32.h aliases CRYP -> AES
         * for these families inside the WOLFSSL_STM32_BARE block but
         * NOT inside the CUBEMX block, so port code that references
         * `CRYP` directly hits an undeclared identifier. Mirror the
         * alias here under cubemx. */
        #if defined(STM32_BOARD_U083) && !defined(CRYP)
            #define CRYP AES
        #endif

        /* H5 HASH IP renames the instance digest registers from HR[5]
         * to HRA[5]. wolfssl's stm32.h auto-defines
         * WC_STM32_HASH_INSTANCE_HRA only inside the WOLFSSL_STM32_BARE
         * block. Apply the same gate for CUBEMX so stm32.c's HASH
         * reader compiles against HASH->HRA on H5 silicon. */
        #if defined(STM32_BOARD_H5) || defined(STM32_BOARD_H573)
            #define WC_STM32_HASH_INSTANCE_HRA
        #endif

        /* On WBA52 / H7S3 (and likely C5A3) the RNG IP cells need a
         * non-standard CONDRST / NIST-conditioning init that HAL_RNG_Init
         * does not perform -- HAL_RNG_GenerateRandomNumber then times
         * out and wolfssl's wc_GenerateSeed returns RAN_BLOCK_E. The
         * BARE wc_GenerateSeed in wolfcrypt/src/random.c has the right
         * register sequence (see C5 NIST init block) but the CUBEMX
         * path goes through HAL. Until that's wired, drop HW RNG on
         * cubemx for these chips so the bench reaches the algorithm
         * sweep. Wolfssl falls back to its SHA-256 software DRBG. */
        #if defined(STM32_BOARD_WBA52) || defined(STM32_BOARD_H7S3) || \
            defined(STM32_BOARD_C5A3) || defined(STM32_BOARD_C562)
            #undef  STM32_RNG
            #define NO_STM32_RNG
        #endif
        #define BUILD_CONFIG_NAME "bare(cubemx)"
    #else
        /* Direct-register crypto. Reached by BUILD=bare, and also by
         * BUILD=cubemx on a new-generation-HAL part (STM32_HAL_NEWGEN, e.g.
         * STM32C5): that HAL has no classic CRYP/PKA/CCB/RNG driver APIs, so
         * wolfcrypt drives the IP blocks via registers while the new-gen HAL
         * handles only board bring-up (clock/UART). The crypto is identical to
         * a pure BARE build. */
        #define WOLFSSL_STM32_BARE
        /* WOLFSSL_STM32_RNG_NOLIB is auto-defined by settings.h when BARE is set */
        #if defined(STM32_HAL_NEWGEN)
            #define BUILD_CONFIG_NAME "bare(hal-newgen)"
        #else
            #define BUILD_CONFIG_NAME "bare"
        #endif
    #endif
#elif defined(BUILD_ASM)
    /* Cortex-M Thumb2 inline-assembly accelerated software (no STM32 HW).
     * Routes SHA/Chacha/Poly/AES/Curve25519/SHA512 through the
     * wolfcrypt/src/port/arm/thumb2-*-asm_c.c sources, plus SP-math
     * Cortex-M ASM for RSA/DH/ECC. Adds Dilithium (post-quantum sig)
     * with the small-stack variant. */
    #undef  STM32_CRYPTO
    #undef  STM32_HASH
    #undef  STM32_RNG
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define NO_STM32_RNG
    #define WOLFSSL_ARMASM
    #define WOLFSSL_ARMASM_THUMB2
    #define WOLFSSL_ARMASM_INLINE
    #define WOLFSSL_ARMASM_NO_HW_CRYPTO
    #define WOLFSSL_ARMASM_NO_NEON
    #define WOLFSSL_ARM_ARCH 7
    #define WOLFSSL_NO_HASH_RAW
    #define WOLFSSL_ARMASM_AES_BLOCK_INLINE
    #define WC_OMIT_FRAME_POINTER

    /* SP-math Cortex-M ASM for RSA/DH/ECC -- routes ECC P-256 / P-384 /
     * P-521 and the RSA/DH limb math through wolfcrypt/src/sp_cortexm.c.
     * Validated 2026-05-22 across M3 (f207), M4F (g491), M33F (wba52),
     * M7F (h7): full ECC + Curve25519 + Ed25519 PASS.
     *
     * Note: sp_cortexm.c relies on the `register sp_digit* x __asm__("rN")`
     * binding form for AAPCS-fixed arg slots (the inline asm intentionally
     * clobbers the slot of `m` as a scratch in mont_sub etc.). Defining
     * WOLFSSL_NO_VAR_ASSIGN_REG -- which the BUILD_ASM block did pre-cleanup
     * -- removes those bindings and reintroduces the prior UNALIGNED fault
     * on first ECC op. Do NOT add WOLFSSL_NO_VAR_ASSIGN_REG back here. */
    #define WOLFSSL_SP_ARM_CORTEX_M_ASM
    #define WOLFSSL_HAVE_SP_RSA
    #define WOLFSSL_HAVE_SP_DH
    #define WOLFSSL_HAVE_SP_ECC
    #define WOLFSSL_SP_SMALL
    #define SP_WORD_SIZE 32
    #define WOLFSSL_SP_4096
    #define WOLFSSL_SP_384
    #define WOLFSSL_SP_521

    /* Balanced GCM table size (4-bit window) -- not strictly tied to
     * ARMASM but the asm config is typically size-conscious anyway. */
    #define GCM_TABLE_4BIT

    /* Dilithium post-quantum signature (small-stack variant).
     * Dilithium uses SHAKE-128/256 internally; enable SHA-3 + SHAKE.
     * The thumb2-sha3-asm_c.c port exists upstream but pulling it in
     * unconditionally pushes wl55 (256 KB flash) over capacity. SHA3
     * stays on the C path here -- WC_SHA3_NO_ASM scopes the #undef of
     * WOLFSSL_ARMASM to sha3.c only (everywhere else, ARMASM stays
     * active for SHA-256, AES, ChaCha, Curve25519, SHA-512). */
    #define HAVE_DILITHIUM
    #define WOLFSSL_DILITHIUM_SMALL
    #define WOLFSSL_SHA3
    #define WOLFSSL_SHAKE128
    #define WOLFSSL_SHAKE256
    #ifndef STM32_BARE_SHA3_ASM
        #define WC_SHA3_NO_ASM
    #endif

    #define BUILD_CONFIG_NAME "asm"
#elif defined(BUILD_C)
    /* Pure software baseline -- disable all STM32 HW paths */
    #undef  STM32_CRYPTO
    #undef  STM32_HASH
    #undef  STM32_RNG
    #define NO_STM32_CRYPTO
    #define NO_STM32_HASH
    #define NO_STM32_RNG
    #define BUILD_CONFIG_NAME "c"
#else
    #error "Define BUILD_BARE / BUILD_ASM / BUILD_C"
#endif

/* ---------------------------------------------------------------------- */
/* PQC axis (Makefile PQC=1 -> -DSTM32_BARE_PQC)                          */
/* Enables ML-DSA (Dilithium) and ML-KEM with the small-memory variants,  */
/* mirroring the wolfBoot resource-constrained preset. Dilithium needs    */
/* SHA-3 / SHAKE-128 / SHAKE-256, so those are pulled in too. Substantial */
/* code: small-flash boards (c031, g071, u083) may overflow.              */
/* ---------------------------------------------------------------------- */
#if defined(STM32_BARE_PQC)
    /* ML-DSA (Dilithium) - small-memory variants */
    #define HAVE_DILITHIUM
    #define WOLFSSL_DILITHIUM_NO_LARGE_CODE
    #define WOLFSSL_DILITHIUM_SMALL
    #define WOLFSSL_DILITHIUM_VERIFY_SMALL_MEM
    #define WOLFSSL_DILITHIUM_VERIFY_NO_MALLOC

    /* ML-KEM (Kyber) - small-memory variants */
    #define WOLFSSL_HAVE_MLKEM
    #define WOLFSSL_MLKEM_MAKEKEY_SMALL_MEM
    #define WOLFSSL_MLKEM_ENCAPSULATE_SMALL_MEM

    /* Dilithium SHAKE dependencies */
    #ifndef WOLFSSL_SHA3
        #define WOLFSSL_SHA3
    #endif
    #ifndef WOLFSSL_SHAKE128
        #define WOLFSSL_SHAKE128
    #endif
    #ifndef WOLFSSL_SHAKE256
        #define WOLFSSL_SHAKE256
    #endif
    /* asm path scopes WOLFSSL_ARMASM off for sha3.c (thumb2-sha3 ASM
     * is not pulled in -- see wl55 flash-overflow note in Makefile). */
    #if defined(BUILD_ASM) && !defined(STM32_BARE_SHA3_ASM) && \
        !defined(WC_SHA3_NO_ASM)
        #define WC_SHA3_NO_ASM
    #endif
#endif

/* ---------------------------------------------------------------------- */
/* STACK measurement axis (Makefile STACK=1 -> -DSTM32_BARE_STACK_TRACK)  */
/* Enables per-algorithm peak stack + peak heap reporting in wolfcrypt    */
/* benchmark output. Routes XMALLOC through wolfssl's trackable wrapper   */
/* (USE_WOLFSSL_MEMORY) and paints the linker-script stack region with a  */
/* sentinel so HAVE_STACK_SIZE_VERBOSE can walk it for high-water marks.  */
/* The board-side adapter lives in boards/common/board_common.c and is   */
/* invoked from main_bench.c after board_init() returns.                  */
/* ---------------------------------------------------------------------- */
#if defined(STM32_BARE_STACK_TRACK)
    #define USE_WOLFSSL_MEMORY
    #define WOLFSSL_TRACK_MEMORY
    #define WOLFSSL_TRACK_MEMORY_VERBOSE
    #define HAVE_STACK_SIZE
    #define HAVE_STACK_SIZE_VERBOSE
#endif

/* ---------------------------------------------------------------------- */
/* Common settings                                                        */
/* ---------------------------------------------------------------------- */
#define WC_ASYNC_DEV_SIZE (320+24)

