dgarske/wolfssl-examples-stm32/STM32_Bare_Test/user_settings.h
/* Single-threaded bare-metal, no filesystem */
#define SINGLE_THREADED
#define NO_FILESYSTEM
#define NO_WRITEV
#define NO_WOLFSSL_SMALL_STACK
#define WOLFSSL_USER_IO
#define NO_MAIN_DRIVER
#define WOLFCRYPT_ONLY

/* Timing resistance */
#define ECC_TIMING_RESISTANT

/* Test settings */
#define BENCH_EMBEDDED
#define NO_MULTIBYTE_PRINT
#define WOLFSSL_IGNORE_FILE_WARN
#define SIZEOF_LONG_LONG 8
#define NO_DEV_RANDOM
#define WOLFSSL_GENSEED_FORTEST

/* AES - GCM and CCM modes */
#define HAVE_AESGCM
#define HAVE_AESCCM
/* GCM multiply implementation. Default is the 4-bit table (GCM_TABLE_4BIT),
 * which multiplies via gcm->M0; GCM_SMALL multiplies via gcm->H directly.
 * Makefile GCM=small (-> STM32_BARE_GCM_SMALL) selects GCM_SMALL. The DHUK
 * GMAC cross-config KAT builds both and asserts identical tags on the same
 * device key, pinning the GenerateM0() call in Stm32Dhuk_Gmac (a missing M0
 * table only corrupts the table build, not the small build). */
#if defined(STM32_BARE_GCM_SMALL)
    #undef  GCM_TABLE_4BIT
    #define GCM_SMALL
#elif defined(STM32_BARE_GCM_TABLE)
    #undef  GCM_TABLE_4BIT
    #define GCM_TABLE
#else
    #define GCM_TABLE_4BIT
#endif
#define WOLFSSL_AES_DIRECT
#define HAVE_AES_ECB
#define HAVE_AES_DECRYPT
#if defined(STM32_CRYPTO) && !defined(STM32_BOARD_WL55)
    /* Exercise the HW AES-CTR path (the bare wc_AesCtrEncryptBlock transform)
     * in wolfcrypt_test on AES-capable boards. Off for RNG-only parts and for
     * wl55 (256 KB soft-float M4 -- adding CTR overflows flash by ~212 B; the
     * other TinyAES/CRYP/SAES boards still cover this path). */
    #define WOLFSSL_AES_COUNTER
#endif

/* Hashes */
#define WOLFSSL_SHA384
#define WOLFSSL_SHA512
#define HAVE_HASHDRBG
#define NO_MD4

/* HMAC / KDF */
#define HAVE_HKDF

/* SRAM PUF regression (TARGET=puf). Synthetic-SRAM test mode so it
 * runs on any board without a board-specific NOLOAD section. HKDF is
 * already enabled above. WC_PUF_BCH_T / WC_PUF_NUM_CODEWORDS come from
 * the build command (PUF_T / PUF_CW). */
#ifdef STM32_BARE_PUF
    #define WOLFSSL_PUF
    #define WOLFSSL_PUF_TEST
#endif

/* ChaCha20-Poly1305 */
#define HAVE_CHACHA
#define HAVE_POLY1305
#define HAVE_ONE_TIME_AUTH

/* ECC */
#define HAVE_ECC
#define WOLFSSL_SP_MATH
#define WOLFSSL_HAVE_SP_ECC
#define WOLFSSL_SP_384
#define WOLFSSL_SP_521
#define WOLFSSL_SP_SMALL
#define SP_WORD_SIZE 32

/* Curve25519 / Ed25519 */
#define HAVE_CURVE25519
#define HAVE_ED25519

/* Cert buffers for test */
#define USE_CERT_BUFFERS_256
#define WOLFSSL_CERT_GEN
#define WOLFSSL_KEY_GEN

/* Drop unused algorithms */
#define NO_RSA
#define NO_DH
#define NO_DSA
#define NO_RC4
#define NO_PKCS12
#define NO_DES3
#define NO_DES3_TLS_SUITES

/* Time -- no RTC, bypass certificate date checking */
#define NO_ASN_TIME
#define WOLFSSL_USER_CURRTIME

/* Diagnostic: uncomment to print which BARE GCM path (HW vs SW fallback)
 * is taken on each call. Off by default to keep benchmark output clean. */
/* #define DEBUG_STM32_BARE_GCM */

/* Error strings */
#define HAVE_ERRNO
#define WOLFSSL_GMTIME

/* ---------------------------------------------------------------------- */
/* U083 size-trim overrides                                               */
/* ---------------------------------------------------------------------- */
/* Default config is ~290 KB of text; U083 has 256 KB flash. Strip the
 * heavy-tail algorithms (P-384/P-521, Curve25519/Ed25519, SHA-384/512,
 * AES-CCM, cert/key gen) to fit. Keep AES + SHA-256 + P-256 + ChaCha20-
 * Poly1305 + HKDF as the minimal viable TLS surface. */
#ifdef STM32_U083_TRIM
    #undef  WOLFSSL_SHA384
    #undef  WOLFSSL_SHA512
    #define NO_SHA384
    #define NO_SHA512
    /* Drop the large SP-math curves -- keep only P-256. ECC P-256
     * still runs in software (no PKA on U0). At 16 MHz on M0+ this
     * is slow -- the full wolfcrypt_test ECC sweep takes several
     * minutes -- but it does PASS. Skipping ECC would lose the
     * coverage; keep it on. */
    #undef  WOLFSSL_SP_384
    #undef  WOLFSSL_SP_521
    /* Drop Curve25519 / Ed25519. */
    #undef  HAVE_CURVE25519
    #undef  HAVE_ED25519
    /* Drop AES-CCM (keep AES-GCM). */
    #undef  HAVE_AESCCM
    /* No cert/key generation. */
    #undef  WOLFSSL_CERT_GEN
    #undef  WOLFSSL_KEY_GEN
#endif

/* C031C6: 32 KB flash / 12 KB RAM. wolfcrypt_test won't fit at all
 * (text alone is ~80+ KB even with all trims). Disable the full suite
 * by undefining the Makefile-injected RUN_WOLFCRYPT_TEST_SUITE flag,
 * and apply the heaviest trim of any board: drop ECC/RSA/DH/RNG/AESGCM,
 * keep only SHA-256 + AES-CBC + ChaCha20-Poly1305 + HKDF as a baseline.
 * main_test.c's KAT block still exercises the path on this board. */
#ifdef STM32_C031_TRIM
    #undef  RUN_WOLFCRYPT_TEST_SUITE
    #undef  WOLFSSL_SHA384
    #undef  WOLFSSL_SHA512
    #define NO_SHA384
    #define NO_SHA512
    #undef  WOLFSSL_SP_384
    #undef  WOLFSSL_SP_521
    #undef  HAVE_CURVE25519
    #undef  HAVE_ED25519
    #undef  HAVE_AESCCM
    #undef  HAVE_AESGCM
    #undef  WOLFSSL_CERT_GEN
    #undef  WOLFSSL_KEY_GEN
    #undef  HAVE_ECC
    #define NO_ECC256
    #undef  HAVE_ECC_KEY_EXPORT
    #undef  HAVE_ECC_KEY_IMPORT
    #undef  HAVE_ECC_DHE
    #undef  HAVE_ECC_SIGN
    #undef  HAVE_ECC_VERIFY
    #define NO_RSA
    #define NO_DH
    #undef  WOLFSSL_SP_4096
    #undef  WOLFSSL_SP_3072
    #undef  WOLFSSL_SP_2048
    #undef  WOLFSSL_SP_1024
    #define NO_ASN
    /* Skip wolfcrypt_test entirely -- doesn't fit. main_test.c KATs
     * (SHA-256 + AES-CBC + AES-ECB + DRBG smoke) are the validation
     * surface on C031. */
    #define WC_NO_HARDEN  /* drop side-channel hardening to save code */
    #define NO_ERROR_STRINGS  /* error.c strings table is ~20 KB */
    #define GCM_SMALL  /* drop GCM tables if AES-GCM crept in via inc */
    #define WOLFSSL_AES_SMALL_TABLES
    #define WOLFSSL_AES_DIRECT
    #define NO_AES_DECRYPT_TABLES
    #define WOLFSSL_NO_MD5
    #define NO_MD5
    #define NO_SHA  /* SHA-1 not needed -- only SHA-256 in KAT */
    #define NO_HMAC  /* main_test.c KAT doesn't use HMAC */
    #define NO_PWDBASED
    #define NO_CHACHAPOLY_AEAD_IUF  /* drop ChaCha incremental API */
    /* C031 has too little flash for ChaCha+Poly+ChaPoly even after
     * other trims. main_test.c KAT block tests SHA-256 + AES only. */
    #define NO_CHACHA_AEAD
    #undef  HAVE_CHACHA
    #undef  HAVE_POLY1305
    #define NO_HASH_WRAPPER  /* drop hash.c generic wrapper */
    /* AES is ~10 KB even small-table -- doesn't fit. C031 baseline
     * becomes "SHA-256 + DRBG smoke" only. The main_test.c AES KAT
     * blocks are #ifdef'd under !NO_AES so they vanish cleanly. */
    #define NO_AES
#endif

/* Callback-only preset (Makefile TARGET=cbonly -> -DSTM32_BARE_CB_ONLY).
 * The four primitives main_cbonly.c exercises -- ECDSA (PKA), AES-GCM (SAES via
 * the DHUK crypto-callback), HMAC-SHA256 (HASH block) and TRNG (RNG) -- all run
 * on hardware, so the software implementations of everything a callback-only
 * build does not need are stripped to shrink flash. Kept: ECC P-256 (+ ASN for
 * DER signatures), AES / AES-GCM, SHA-256, HMAC, RNG. Stripped: RSA, DH, the
 * large SP moduli, SHA-384/512, Curve25519/Ed25519, ChaCha/Poly1305, AES-CCM,
 * PBKDF, cert/key generation and the error-string table. SHA-256 stays because
 * the software Hash-DRBG (used to seed ECC keygen) depends on it. */
#ifdef STM32_BARE_CB_ONLY
    /* True callback-only: strip the software AES and ECC implementations so
     * every AES/ECC op must route through the crypto callback (no SW fallback).
     * AES relies on the wolfSSL aes.c guard that lets the STM32 bare AES path
     * defer to WOLF_CRYPTO_CB_ONLY_AES; ECC relies on the DHUK callback's ECDSA
     * sign + verify handlers (verify -> HW PKA). main_cbonly.c must use a fixed
     * key (no wc_ecc_make_key) since keygen has no device path here. Note: on a
     * sign-only-PKA part (c5a3, WC_STM32_PKA_SIGN_ONLY) there is no HW verify,
     * so WOLF_CRYPTO_CB_ONLY_ECC would break verify there -- keep it to full-PKA
     * boards (u3, u585, u545). */
    #define WOLF_CRYPTO_CB_ONLY_AES
    /* Callback-only ECC only on full-PKA parts. The C5 PKA is sign-only
     * (WC_STM32_PKA_SIGN_ONLY) with no HW ECDSA verify, so stripping software
     * ECC there would leave verify with no implementation. */
    #ifndef WOLFSSL_STM32C5
        #define WOLF_CRYPTO_CB_ONLY_ECC
    #endif
    #define NO_RSA
    #define NO_DH
    #undef  WOLFSSL_SP_4096
    #undef  WOLFSSL_SP_3072
    #undef  WOLFSSL_SP_2048
    #undef  WOLFSSL_SP_1024
    #undef  WOLFSSL_SHA384
    #undef  WOLFSSL_SHA512
    #define NO_SHA384
    #define NO_SHA512
    #undef  WOLFSSL_SP_384
    #undef  WOLFSSL_SP_521
    #undef  HAVE_CURVE25519
    #undef  HAVE_ED25519
    #undef  HAVE_CHACHA
    #undef  HAVE_POLY1305
    #define NO_CHACHA_AEAD
    #define NO_CHACHAPOLY_AEAD_IUF
    #undef  HAVE_AESCCM
    #define NO_PWDBASED
    #undef  WOLFSSL_CERT_GEN
    #undef  WOLFSSL_KEY_GEN
    #define NO_ERROR_STRINGS  /* error.c strings table is ~20 KB */
#endif

/* CubeMX AES crypto-callback test (Makefile TARGET=cubeaes ->
 * -DSTM32_CUBE_AES_ONLY). Turns on WOLF_CRYPTO_CB_ONLY_AES so the software AES
 * core is stripped and every AES op routes through the crypto callback -- the
 * new CubeMX AES device (wc_Stm32_AesRegister). main_cubeaes.c registers it
 * and runs AES-GCM KATs on the HAL. Only AES is exercised; the rest of the
 * common config (ECC/SHA/etc.) stays as software but is unused here. */
#ifdef STM32_CUBE_AES_ONLY
    #define WOLF_CRYPTO_CB_ONLY_AES
#endif

/* CubeMX full HW-crypto callback test (Makefile TARGET=cubecrypto ->
 * -DSTM32_CUBE_CRYPTO_ONLY). Strips software ECC and AES so both route through
 * the crypto callback -- the CubeMX device's HW ECDSA sign/verify (PKA), CCB
 * ECDSA, and HAL AES. This is the customer's config shape; main_cubecrypto.c
 * brings up the ST HAL PKA (hpka + HAL_PKA_Init) that the PKA path needs. */
#ifdef STM32_CUBE_CRYPTO_ONLY
    /* Callback-only ECC only on full-PKA parts, matching STM32_BARE_CB_ONLY
     * above. The C5 PKA is sign-only (WC_STM32_PKA_SIGN_ONLY) with no HW ECDSA
     * verify, so stripping software ECC there would leave verify with no
     * implementation. Latent today (the Makefile pins cubecrypto to BOARD=u3)
     * but keeps the two presets consistent as boards are added. */
    #ifndef WOLFSSL_STM32C5
        #define WOLF_CRYPTO_CB_ONLY_ECC
    #endif
    #define WOLF_CRYPTO_CB_ONLY_AES
#endif

/* G071RB is even tighter -- 128 KB flash / 36 KB RAM, AND no HW crypto
 * at all. The U083 trim still leaves the ECC P-256 SW path in which
 * overflows by ~48 KB. Take a more aggressive cut: drop ECC entirely
 * (no PKA on G071, all ECC is software anyway), drop AES-GCM (keep
 * AES-CBC/CTR), drop RSA and DH. The remaining surface is the symmetric
 * crypto + hashing minimum used by typical embedded TLS-PSK / secure
 * storage workloads. */
#ifdef STM32_G071_TRIM
    #undef  WOLFSSL_SHA384
    #undef  WOLFSSL_SHA512
    #define NO_SHA384
    #define NO_SHA512
    #undef  WOLFSSL_SP_384
    #undef  WOLFSSL_SP_521
    #undef  HAVE_CURVE25519
    #undef  HAVE_ED25519
    #undef  HAVE_AESCCM
    #undef  HAVE_AESGCM
    #undef  WOLFSSL_CERT_GEN
    #undef  WOLFSSL_KEY_GEN
    /* Drop ECC entirely (no HW PKA; SW ECC overflows the 128 KB flash) */
    #undef  HAVE_ECC
    #define NO_ECC256
    #undef  HAVE_ECC_KEY_EXPORT
    #undef  HAVE_ECC_KEY_IMPORT
    #undef  HAVE_ECC_DHE
    #undef  HAVE_ECC_SIGN
    #undef  HAVE_ECC_VERIFY
    /* Drop RSA + DH (asymmetric heavy weight) */
    #define NO_RSA
    #define NO_DH
    /* Drop large math */
    #undef  WOLFSSL_SP_4096
    #undef  WOLFSSL_SP_3072
    #undef  WOLFSSL_SP_2048
    #undef  WOLFSSL_SP_1024
    /* Drop ASN.1 (no certs needed without ECC/RSA) */
    #define NO_ASN
#endif

#ifdef __cplusplus
}
#endif

#endif /* WOLF_USER_SETTINGS_H */
